Revit 2024 API
ExportLayerKey Members
The ExportLayerKey type exposes the following members.
Constructors
Name | Description
ExportLayerKey()
 Constructs a new ExportLayerKey with default values.
ExportLayerKey(String, String, SpecialType)
 Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type.
Methods
Name | Description
Dispose
Releases all resources used by the ExportLayerKey
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CategoryName
 The category name.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
SpecialType
 The special type for layer key.
SubCategoryName
 The subcategrory Name.
See Also
ExportLayerKey Class
Autodesk.Revit.DB Namespace